sdaiRemoveByIterator(Sdai_ItrId*)
\details
Removes an aggregate instance that is referenced by a specified iterator.
\param iterator [in]  An iterator that refers to the current member of the aggregate.